Tekla Open API Reference for Tekla Structures 2025
PluginSymbolVisiblityAttribute Constructor (Int32)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginSymbolVisiblityAttribute(
	int Type
)
Public Sub New (
	Type As Integer
)
Parameters
Type
Type: System.Int32
The type of the input object dependency as an integer.
See Also
Reference
PluginSymbolVisiblityAttribute Class
PluginSymbolVisiblityAttribute Overload
Tekla.Structures.Plugins Namespace